In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    "cust_id": ["C1", "C2", "C3", "C4", "C5"],
    "item_bought": [10,15,20,35,4],
    "city": ["Bandung", "Jakarta", "Bogor", "Tangerang", "Bali"]
    })
df

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali

In [3]:
df["cust_id"]

0    C1
1    C2
2    C3
3    C4
4    C5
Name: cust_id, dtype: object

In [4]:
df["item_bought"]

0    10
1    15
2    20
3    35
4     4
Name: item_bought, dtype: int64

In [5]:
df["city"]

0      Bandung
1      Jakarta
2        Bogor
3    Tangerang
4         Bali
Name: city, dtype: object

In [ ]:
#Creating DataFrame from List of Lists

In [6]:
df = pd.DataFrame([["C1", 10, "Bandung"],
                  ["C2", 15, "Jakarta"],
                  ["C3", 20, "Bogor"],
                  ["C4", 35, "Tangerang"],
                  ["C5", 4, "Bali"]],
                  columns = ["cust_id", "item_bought", "city"])
df

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali

In [ ]:
#Creating DataFrame from Numpy Array

In [7]:
df = pd.DataFrame(np.array([["C1", 10, "Bandung"],
                  ["C2", 15, "Jakarta"],
                  ["C3", 20, "Bogor"],
                  ["C4", 35, "Tangerang"],
                  ["C5", 4, "Bali"]]),
                  columns = ["cust_id", "item_bought", "city"])
df

  cust_id item_bought       city
0      C1          10    Bandung
1      C2          15    Jakarta
2      C3          20      Bogor
3      C4          35  Tangerang
4      C5           4       Bali

In [ ]:
#Creating DataFrame from Dictionary

In [8]:
df = pd.DataFrame({
    "cust_id": ["C1", "C2", "C3", "C4", "C5"],
    "item_bought": [10,15,20,35,4],
    "city": ["Bandung", "Jakarta", "Bogor", "Tangerang", "Bali"]
    })
df

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali

In [ ]:
#Saving a Dataframe

In [ ]:
df.to_csv("customer.csv", index = False)
df.to_excel("customer.xlsx", index = False)

In [ ]:
#Load a Dataframe

In [9]:
df = pd.read_csv("customer.csv")
df = pd.read_excel("customer.xlsx")

In [ ]:
#Summary Info

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   cust_id      5 non-null      object
 1   item_bought  5 non-null      int64
 2   city         5 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [ ]:
#Statistics of Numerical Columns

In [11]:
df.describe()

       item_bought
count     5.000000
mean     16.800000
std      11.777096
min       4.000000
25%      10.000000
50%      15.000000
75%      20.000000
max      35.000000

In [ ]:
#Columns Name

In [12]:
df.columns

Index(['cust_id', 'item_bought', 'city'], dtype='object')

In [ ]:
#DataFrame length

In [13]:
df.shape

(5, 3)

In [14]:
df.shape[0]

5

In [15]:
df.shape[1]

3

In [ ]:
#Values of a particular column

In [16]:
df["cust_id"]

0    C1
1    C2
2    C3
3    C4
4    C5
Name: cust_id, dtype: object

In [ ]:
#Values of several columns

In [17]:
df[["cust_id","city"]]

  cust_id       city
0      C1    Bandung
1      C2    Jakarta
2      C3      Bogor
3      C4  Tangerang
4      C5       Bali

In [ ]:
#First N rows

In [18]:
df.head()

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali

In [19]:
df.head(2)

  cust_id  item_bought     city
0      C1           10  Bandung
1      C2           15  Jakarta

In [ ]:
#Last N rows

In [20]:
df.tail()

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali

In [21]:
df.tail(2)

  cust_id  item_bought       city
3      C4           35  Tangerang
4      C5            4       Bali

In [ ]:
#Random N Rows

In [24]:
df.sample()

  cust_id  item_bought       city
3      C4           35  Tangerang

In [27]:
df.sample(3)

  cust_id  item_bought       city
2      C3           20      Bogor
3      C4           35  Tangerang
1      C2           15    Jakarta

In [ ]:
#Reordering Columns

In [28]:
df = df[["item_bought", "city", "cust_id"]]
df

   item_bought       city cust_id
0           10    Bandung      C1
1           15    Jakarta      C2
2           20      Bogor      C3
3           35  Tangerang      C4
4            4       Bali      C5

In [29]:
df = df.reindex(columns=["item_bought", "city", "cust_id"])
df

   item_bought       city cust_id
0           10    Bandung      C1
1           15    Jakarta      C2
2           20      Bogor      C3
3           35  Tangerang      C4
4            4       Bali      C5

In [ ]:
#Get the value of specific row and column (via its name)

In [30]:
df.loc[0,"item_bought"]

10

In [31]:
df.loc[3,"city"]

'Tangerang'

In [ ]:
#Get the value of specific row and column (via its index num)

In [32]:
df.iloc[0,0]

10

In [33]:
df.iloc[3,1]

'Tangerang'

In [ ]:
#Get the specific ranges of rows and columns (via its name)

In [34]:
df.loc[0:2,["item_bought","city"]]

   item_bought     city
0           10  Bandung
1           15  Jakarta
2           20    Bogor

In [ ]:
#Get the specific ranges of rows and columns (via its index num)

In [35]:
df.iloc[0:3,0:2]

   item_bought     city
0           10  Bandung
1           15  Jakarta
2           20    Bogor

In [ ]:
#Filter dataframe with a criteria

In [36]:
df[df["item_bought"]>15]

   item_bought       city cust_id
2           20      Bogor      C3
3           35  Tangerang      C4

In [ ]:
#Filter dataframe with several criterias (AND)

In [37]:
df[(df["item_bought"]>15) & (df["city"]!= "Bogor")]

   item_bought       city cust_id
3           35  Tangerang      C4

In [ ]:
#Filter dataframe with several criterias (OR)

In [38]:
df[(df["item_bought"]>15) | (df["city"]!= "Bogor")]

   item_bought       city cust_id
0           10    Bandung      C1
1           15    Jakarta      C2
2           20      Bogor      C3
3           35  Tangerang      C4
4            4       Bali      C5

In [ ]:
#Check missing values

In [48]:
df = pd.DataFrame({
    "cust_id": ["C1", "C2", "C3", "C4", "C5", "C6"],
    "item_bought": [10,15,20,35,4, np.nan],
    "city": ["Bandung", "Jakarta", "Bogor", "Tangerang", "Bandung", np.nan]
    })
df

  cust_id  item_bought       city
0      C1         10.0    Bandung
1      C2         15.0    Jakarta
2      C3         20.0      Bogor
3      C4         35.0  Tangerang
4      C5          4.0    Bandung
5      C6          NaN        NaN

In [40]:
df.isna().sum()

cust_id        0
item_bought    1
city           1
dtype: int64

In [ ]:
#Handle Missing Values

In [ ]:
#Remove rows

In [41]:
df.dropna()

  cust_id  item_bought       city
0      C1         10.0    Bandung
1      C2         15.0    Jakarta
2      C3         20.0      Bogor
3      C4         35.0  Tangerang
4      C5          4.0    Bandung

In [ ]:
#Fill with 0 for numerical

In [42]:
df["item_bought"] = df["item_bought"].fillna(0)
df

  cust_id  item_bought       city
0      C1         10.0    Bandung
1      C2         15.0    Jakarta
2      C3         20.0      Bogor
3      C4         35.0  Tangerang
4      C5          4.0    Bandung
5      C6          0.0        NaN

In [ ]:
#Fill with mean/median

In [45]:
df["item_bought"] = df["item_bought"].fillna(df["item_bought"].mean())
df

  cust_id  item_bought       city
0      C1         10.0    Bandung
1      C2         15.0    Jakarta
2      C3         20.0      Bogor
3      C4         35.0  Tangerang
4      C5          4.0    Bandung
5      C6         16.8        NaN

In [47]:
df["item_bought"] = df["item_bought"].fillna(df["item_bought"].median())
df

  cust_id  item_bought       city
0      C1         10.0    Bandung
1      C2         15.0    Jakarta
2      C3         20.0      Bogor
3      C4         35.0  Tangerang
4      C5          4.0    Bandung
5      C6         15.0        NaN

In [ ]:
#Fill with mode for categorical

In [49]:
df["city"] = df["city"].fillna(df["city"].mode()[0])
df

  cust_id  item_bought       city
0      C1         10.0    Bandung
1      C2         15.0    Jakarta
2      C3         20.0      Bogor
3      C4         35.0  Tangerang
4      C5          4.0    Bandung
5      C6          NaN    Bandung

In [ ]:
#Check outliers

In [50]:
df = pd.DataFrame({
    "cust_id": ["C1", "C2", "C3", "C4", "C5", "C6", "C7", "C8", "C9", "C10", "C11"],
    "item_bought": [10,7,5,4,10000, 10, 5, 5, 7, 4, 5],
    "city": ["Bandung", "Jakarta", "Bogor", "Tangerang", "Bandung", "Bogor", "Bogor", "Bogor", "Bandung", "Jakarta", "Bogor"]
    })
df

   cust_id  item_bought       city
0       C1           10    Bandung
1       C2            7    Jakarta
2       C3            5      Bogor
3       C4            4  Tangerang
4       C5        10000    Bandung
5       C6           10      Bogor
6       C7            5      Bogor
7       C8            5      Bogor
8       C9            7    Bandung
9      C10            4    Jakarta
10     C11            5      Bogor

In [ ]:
#Z-Score

In [51]:
import scipy.stats as stats

In [52]:
df[(np.abs(stats.zscore(df["item_bought"])) >= 3)]

  cust_id  item_bought     city
4      C5        10000  Bandung

In [ ]:
#IQR

In [53]:
q1 = df["item_bought"].quantile(0.25)
q3 = df["item_bought"].quantile(0.75)

iqr = q3-q1 #Interquartile range
fence_low  = q1-1.5*iqr
fence_high = q3+1.5*iqr

df.loc[(df["item_bought"] < fence_low) | (df["item_bought"] > fence_high)]

  cust_id  item_bought     city
4      C5        10000  Bandung

In [ ]:
#Handle Outliers

In [54]:
#Z-Score
df_clean = df[(np.abs(stats.zscore(df["item_bought"])) < 3)]

#IQR
df_clean = df.loc[(df["item_bought"] >= fence_low) & (df["item_bought"] <= fence_high)]

df_clean

   cust_id  item_bought       city
0       C1           10    Bandung
1       C2            7    Jakarta
2       C3            5      Bogor
3       C4            4  Tangerang
5       C6           10      Bogor
6       C7            5      Bogor
7       C8            5      Bogor
8       C9            7    Bandung
9      C10            4    Jakarta
10     C11            5      Bogor

In [ ]:
#Check Duplicates

In [55]:
df = pd.DataFrame({
    "cust_id": ["C1", "C2", "C3", "C4", "C5", "C6", "C7", "C8", "C9", "C10", "C7"],
    "item_bought": [10,7,5,4,10000, 10, 5, 5, 7, 4, 5],
    "city": ["Bandung", "Jakarta", "Bogor", "Tangerang", "Bandung", "Bogor", "Bogor", "Bogor", "Bandung", "Jakarta", "Bogor"]
    })
df

   cust_id  item_bought       city
0       C1           10    Bandung
1       C2            7    Jakarta
2       C3            5      Bogor
3       C4            4  Tangerang
4       C5        10000    Bandung
5       C6           10      Bogor
6       C7            5      Bogor
7       C8            5      Bogor
8       C9            7    Bandung
9      C10            4    Jakarta
10      C7            5      Bogor

In [56]:
df.duplicated().sum()

1

In [ ]:
#Handle Duplicates

In [57]:
df.drop_duplicates()

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2            7    Jakarta
2      C3            5      Bogor
3      C4            4  Tangerang
4      C5        10000    Bandung
5      C6           10      Bogor
6      C7            5      Bogor
7      C8            5      Bogor
8      C9            7    Bandung
9     C10            4    Jakarta

In [58]:
df = pd.DataFrame({
    "name": ["Anna", "Dane", "David", "Kevin", "Joe", "Rose"],
    "weight": [45.2, 50.5, 62.1, 64.0, 59.0, np.nan],
    "height": [155, 160, 162, 170, 167, 159],
    "birth_year": [2000,1997,1996,1987,1998,2003],
    "gender": ["female", "male", "male", "male", "male", "female"],
    "city": ["New York", "Chicago", "Austin", "New York", np.nan, "New York"]
    })
df

    name  weight  height  birth_year  gender      city
0   Anna    45.2     155        2000  female  New York
1   Dane    50.5     160        1997    male   Chicago
2  David    62.1     162        1996    male    Austin
3  Kevin    64.0     170        1987    male  New York
4    Joe    59.0     167        1998    male       NaN
5   Rose     NaN     159        2003  female  New York

In [59]:
df[["name", "birth_year", "height", "weight", "city", "gender"]]

    name  birth_year  height  weight      city  gender
0   Anna        2000     155    45.2  New York  female
1   Dane        1997     160    50.5   Chicago    male
2  David        1996     162    62.1    Austin    male
3  Kevin        1987     170    64.0  New York    male
4    Joe        1998     167    59.0       NaN    male
5   Rose        2003     159     NaN  New York  female